app/Controllers/Admin/Entregadores.php

SELECT *
FROM `entregadores`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `entregadores`
---
    public function index()
    {
        $data = [
            'titulo' => 'Entregadores',
            'entregadores' => $this->entregadorModel->withDeleted(true)->paginate(10),