app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
---
    public function index()
    {

        $data =[
            'titulo' => 'Listando os usuarios',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(10),