app/Controllers/Pedidos.php

INSERT INTO `pedidos` (`cliente_id`, `produtos`, `endereco`, `quantidade`, `total`, `criado_em`, `atualizado_em`) VALUES ('1', 'Pizza de Calabresa', 'rua das seringueiras,943', '1', '100,00', '2024-08-21 22:00:13', '2024-08-21 22:00:13')
---

        // Salva os dados no banco de dados
        try {
            $this->pedidoModel->insert($pedidoData);