app/Controllers/Pedidos.php

INSERT INTO `pedidos` (`cliente_id`, `endereco`, `status`, `total`, `produtos`, `sabores`, `extras`, `medida_id`, `quantidade`, `criado_em`, `atualizado_em`) VALUES ('1', 'Rua das seringueiras,943', 'pendente', '100,00', 1, '5,1', '1,2', '3', '1', '2024-08-23 20:36:00', '2024-08-23 20:36:00')
---
    ];

    // Inserção no banco de dados
    if ($this->pedidoModel->insert($pedidoData)) {