app/Models/ProdutoModel.php

    public function buscaProdutosWebHome() {
        // Executa a consulta para buscar os dados
        $resultados = $this->select([
                'produtos.id',
                'produtos.nome',
                'produtos.ingredientes',
                'produtos.slug',
                'produtos.imagem',
                'categorias.id AS categoria_id',
                'categorias.nome AS categoria',
                'categorias.slug AS categoria_slug',
                'medidas.nome AS medida', // Supondo que "nome" seja a coluna para o nome da medida
                'produtos_especificacoes.preco',
                'produtos_especificacoes.customizavel' // Seleciona se o produto é customizável
            ])
            ->join('categorias', 'categorias.id = produtos.categoria_id')
            ->join('produtos_especificacoes', 'produtos_especificacoes.produto_id = produtos.id')
            ->join('medidas', 'medidas.id = produtos_especificacoes.medida_id') // Supondo que "medida_id" seja a coluna de referência
            ->where('produtos.ativo', true)
            ->orderBy('categorias.nome', 'ASC')
            ->orderBy('produtos.id', 'ASC')  // Ordena por produto para facilitar a visualização
            ->findAll();
---
SELECT `produtos`.`id`, `produtos`.`nome`, `produtos`.`ingredientes`, `produtos`.`slug`, `produtos`.`imagem`, `categorias`.`id` AS `categoria_id`, `categorias`.`nome` AS `categoria`, `categorias`.`slug` AS `categoria_slug`, `medidas`.`nome` AS `medida`, `produtos_especificacoes`.`preco`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
JOIN `produtos_especificacoes` ON `produtos_especificacoes`.`produto_id` = `produtos`.`id`
JOIN `medidas` ON `medidas`.`id` = `produtos_especificacoes`.`medida_id`
WHERE `produtos`.`ativo` = 1
AND `produtos`.`deletado_em` IS NULL
ORDER BY `categorias`.`nome` ASC, `produtos`.`id` ASC