app/Models/ProdutoEspecificacaoModel.php

SELECT `medidas`.`nome` AS `medida`, `produtos_especificacoes`.*
FROM `produtos_especificacoes`
JOIN `medidas` ON `medidas`.`id` = `produtos_especificacoes`.`medida_id`
JOIN `produtos` ON `produtos`.`id` = `produtos_especificacoes`.`produto_id`
WHERE `produtos_especificacoes`.`produto_id` = 2
---
    public function buscaEspecificacoesProdutoSemPaginacao(int $produto_id)
    {
        return $this->select('medidas.nome AS medida,
                              produtos_especificacoes.*,
                              produtos.nome AS produto_nome') // Adicione aqui outros nomes que deseja retornar
                    ->join('medidas', 'medidas.id = produtos_especificacoes.medida_id')
                    ->join('produtos', 'produtos.id = produtos_especificacoes.produto_id')
                    ->where('produtos_especificacoes.produto_id', $produto_id)
                    ->findAll(); // Utiliza findAll() para retornar todos os resultados sem paginação